In [6]:
import numpy as np
import pandas as pd
labels = ['First','Second','Third']
values = [10,20,30]

In [7]:
A = pd.Series(values)
A

0    10
1    20
2    30
dtype: int64

In [8]:
B = pd.Series(values, labels)
B

First     10
Second    20
Third     30
dtype: int64

In [9]:
array = np.arange(10,31,10)
C = pd.Series(array, labels)
C

First     10
Second    20
Third     30
dtype: int64

In [10]:
dic = {'Frist':10, 'Second':20, 'Third':30}
D = pd.Series(dic)
D

Frist     10
Second    20
Third     30
dtype: int64

In [19]:
pool1 = pd.Series([1,2,3,4],['USA','Britain','France','Germany'])
pool1

USA        1
Britain    2
France     3
Germany    4
dtype: int64

In [20]:
pool2 = pd.Series(['USA','Britain','France','Germany'],[1,2,3,4])
pool2

1        USA
2    Britain
3     France
4    Germany
dtype: object

In [13]:
pool2[2]

'Britain'

In [22]:
pool3 = pd.Series([1,2,3,4], ['USA','USSR','France','Germany'])
pool3

USA        1
USSR       2
France     3
Germany    4
dtype: int64

In [23]:
double_pool = pool1 + pool1
double_pool

USA        2
Britain    4
France     6
Germany    8
dtype: int64

In [24]:
mixed_pool = pool1 + pool3
mixed_pool

Britain    NaN
France     6.0
Germany    8.0
USA        2.0
USSR       NaN
dtype: float64

In [25]:
funny_pool = pool1 + pool2
funny_pool

1          NaN
2          NaN
3          NaN
4          NaN
Britain    NaN
France     NaN
Germany    NaN
USA        NaN
dtype: object